import './App.css';
import {Routes, Route } from "react-router-dom";
import { useState } from 'react';

import Test from "./pages/Test";
import Admin from "./pages/Admin";

const defaultQuestions = [
  { text: "تفکر نو و ابداع روش‌هایی برای تصور و انجام امور، مانند موفقیت هنری.", media: null, mediaType: null, category: "دانش و خرد" },
  { text: "علاقه به یک تجربه مداوم تنها به خاطر خود آن موضوع، کشف موضوعات و مباحث جذاب، جستجو و اکتشاف", media: null, mediaType: null, category: "دانش و خرد" },
  { text: "  تفکر در مورد امور و بررسی تمامی جنبه‌‌های آن‌ها، پرهیز از نتیجه‌گیری‌های شتاب‌زده، توانایی تغییر در افکار بر اساس شواهد و مدارک، ارزیابی منصفانه تمامی شواهد ", media: null, mediaType: null, category: "دانش و خرد" },
  { text: "تسلط بر مهارت‌ها، موضوعات و مجموعه‌ای از دانش‌خواه در ذهن یک فرد یا به طور رسمی؛ ظاهراً این توانمندی با توانمندی کنجکاوی مرتبط است اما از لحاظ تمایل به فراتر رفتن از آنچه شخص می‌داند از کنجکاوی فراتر می‌رود", media: null, mediaType: null, category: "دانش و خرد" },
  { text: "  توانایی ارائه راهنمایی وتدابیر عاقلانه به سایرین؛ توانایی نگریستن به جهان به نحوی که درکی برای خود و دیگران فراهم آور ", media: null, mediaType: null, category: "دانش و خرد" },
  { text: "عقب نکشیدن از تهدید وترس، چالش، سختی، درد؛ اعلام قاطعانه آنچه که صحیح است ولو اینکه با مخالفت روبه‌رو شود؛ عمل کردن مطابق عقیده حتی اگر آن عقیده رایج نباشد؛ به عنوان نمونه می‌توان به بی‌باکی جسمانی اشاره کرد اما فقط به این محدود نمی‌شود", media: null, mediaType: null, category: "شجاعت" },
  { text: "به اتمام رساندن آنچه که شخص شروع می‌نماید؛ پافشاری بر یک موضوع با وجود موانع و مشکلات؛ احساس لذت از به اتمام رساندن کارها", media: null, mediaType: null, category: "شجاعت" },
  { text: "صادقانه صحبت کردن و اتخاذ یک مسیر درست و عمل خالصانه براساس آن؛ عدم تظاهر و ریا؛ احساس مسئولیت نسبت به احساسات و فعالیت‌های شخصی", media: null, mediaType: null, category: "شجاعت" },
  { text: "زندگی توأم با هیجان و انرژی؛ عدم انجام کارها به صورت نیمه‌کاره و ناقص؛ سپری کردن زندگی به صورت ماجراجویانه؛ احساس سرزندگی و فعال بودن", media: null, mediaType: null, category: "شجاعت" },
  { text: " ارزش قائل شدن برای ارتباط نزدیک با دیگران؛ به ویژه با افرادی که به صورت متقابل مهربانی و احساس نزدیکی دارند؛ صمیمیت با مردم.", media: null, mediaType: null, category: "انسان‌دوستی" },
  { text: "نیکی به دیگران و مراقبت از آن‌ها", media: null, mediaType: null, category: "انسان‌دوستی" },
  { text: " آگاهی از انگیزه‌ها و احساسات سایر مردم و خود، اطلاع از انجام اعمال متناسب با موقعیت‌های اجتماعی مختلف؛ آگاهی از آنچه که احساس دیگران را جریحه‌دار می‌کند", media: null, mediaType: null, category: "انسان‌دوستی" },
  { text: "انجام درست امور به عنوان عضوی از گروه یا تیم؛ وفاداری به گروه؛ مشارکت درانجام امو", media: null, mediaType: null, category: "عدالت" },
  { text: " رفتار منصفانه و بدون سوگیری با دیگران؛ پرهیز از تصمیمات احساسی و سوگیرانه نسبت به دیگران؛ دادن شانس موفقیت به سایرین", media: null, mediaType: null, category: "عدالت" },
  { text: "  تشویق یک گروه به این مسئله که آن‌ها به عنوان یک عضو کار خود را انجام دهند و در عین حال روابط خود را با گروه حفظ کنند؛ سازماندهی فعالیت‌های گروهی و نظارت بر انجام آن‌ها.  ", media: null, mediaType: null, category: "عدالت" },
  { text: " گذشت از اشتباهات دیگران؛ پذیرش کاستی‌‌های سایرین؛ دادن شانس دوباره به افراد؛ انتقام‌جو نبودن", media: null, mediaType: null, category: "اعتدال" },
  { text: "فضائل و کمالات را مایه مباهات قرار ندادن؛ خود را بیشتر از آنچه که هست نشان ندادن", media: null, mediaType: null, category: "اعتدال" },
  { text: " مراقب انتخاب‌های خود بودن؛ پرهیز از ریسک‌های بی‌مورد؛ نگفتن و انجام ندادن حرف‌ها و اموری  که ممکن است بعدها پشیمانی به بار آورد.", media: null, mediaType: null, category: "اعتدال" },
  { text: " تنظیم آنچه که احساس می‌کنیم و انجام می‌دهیم؛ منظم بودن، کنترل هیجان‌ها.", media: null, mediaType: null, category: "اعتدال" },
  { text: " توجه به زیبایی و درک، عملکرد ماهرانه در جنبه‌های مختلف زندگی، از طبیعت گرفته تا هنر، ریاضیات، علم جنبه‌های دیگ", media: null, mediaType: null, category: "تعالی" },
  { text: " آگاهی و قدردانی از رویدادها و رویدادهای خوشایندی که اتفاق می‌افتد؛ اختصاص زمانی برای ابراز تشکر و قدردانی", media: null, mediaType: null, category: "تعالی" },
  { text: " انتظار اتفاق افتادن بهترین‌ها در آینده و تلاش برای رسیدن به آن؛ باور به این موضوع که یک آینده‌ی خوب می‌تواند اتفاق بیافتد", media: null, mediaType: null, category: "تعالی" },
  { text: "تمایل به خنده و شوخی؛ خنده به لب افراد آوردن؛ دیدن جنبه‌های مثبت و روشن؛ ساختن لطیفه (نه لزوماً گفتن لطیفه).", media: null, mediaType: null, category: "تعالی" },
  { text: "اعتقاد راسخ به هدف و معنای والا برای زندگی؛ اطلاع از آنچه که یک شخص را با الگوهای برتر تطبیق می‌دهد؛ داشتن معنا و هدف برای زندگی که آرامش را به ارمغان می‌آورد.", media: null, mediaType: null, category: "تعالی" },
];


function App() {
  const [questions, setQuestions] = useState(defaultQuestions);

  return (
    <div className='container'>
      <Routes>
        <Route path='/' element={<Test questions={questions} setQuestions={setQuestions} />} />
        <Route path='/Admin' element={<Admin questions={questions} setQuestions={setQuestions} />} />
      </Routes>
    </div>
  );
}

export default App;
